EDT/КассовыйСервер/src/Catalogs/ксКассыККМ/ксКассыККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ксКассыККМ</name>
  <comment>(Общ)</comment>
  <owners>Catalog.ксОрганизации</owners>
  <attributes>
    <name>ФормироватьНефискальныеЧеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЛенты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнойРежимФормирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрикладнаяПрограмма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОнлайнКасса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресККМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомерККТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерККТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерККМВДрайвереАтол</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеВыводитьДанныеНаПечать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительККМ</name>
    <type>
      <types>CatalogRef.ксПроизводителиККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФФД</name>
    <type>
      <types>EnumRef.ВерсииФФД</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/КассовыйСервер/src/InformationRegisters/ксСтатусыСостоянияККМ/ксСтатусыСостоянияККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ксСтатусыСостоянияККМ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеККМОчередьПечатиЧеков</name>
    <type>
      <types>EnumRef.ксСостоянияККМОчередиПечатиЧеков</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкиПечатиККМ</name>
    <comment>КоличествоОшибок</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусУстановленWEBСервисом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ККМ</name>
    <type>
      <types>CatalogRef.ксКассыККМ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/КассовыйСервер/src/Enums/ксСостоянияККМОчередиПечатиЧеков/ксСостоянияККМОчередиПечатиЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ксСостоянияККМОчередиПечатиЧеков</name>
  <enumValues>
    <name>ККМСвободна</name>
  </enumValues>
  <enumValues>
    <name>ККМЗанята</name>
  </enumValues>
  <enumValues>
    <name>ККМВыключена</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПечати</name>
  </enumValues>
  <enumValues>
    <name>ККМЗахваченаКассиром</name>
  </enumValues>
</mdclass:Enum>

EDT/КассовыйСервер/src/Catalogs/ксКассыККМ/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ВосстановитьККМ.Доступность = Ложь;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ксСтатусыСостоянияККМСрезПоследних.Период КАК Период,
	                      |	ксСтатусыСостоянияККМСрезПоследних.ККМ КАК ККМ,
	                      |	ксСтатусыСостоянияККМСрезПоследних.СостояниеККМОчередьПечатиЧеков КАК СостояниеККМОчередьПечатиЧеков,
	                      |	ксСтатусыСостоянияККМСрезПоследних.ОшибкиПечатиККМ КАК ОшибкиПечатиККМ
	                      |ИЗ
	                      |	РегистрСведений.ксСтатусыСостоянияККМ.СрезПоследних(, ККМ = &ККМ) КАК ксСтатусыСостоянияККМСрезПоследних");
	Запрос.УстановитьПараметр("ККМ", Объект.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда	
		
		// флаг
		Если Рез.СостояниеККМОчередьПечатиЧеков = Перечисления.ксСостоянияККМОчередиПечатиЧеков.ККМВыключена Тогда
			ККМВключена = Ложь;	
		Иначе
	        ККМВключена = Истина;
		КонецЕсли;	
		
		// кнопка
		Если Рез.СостояниеККМОчередьПечатиЧеков = Перечисления.ксСостоянияККМОчередиПечатиЧеков.ОшибкаПечати И Рез.ОшибкиПечатиККМ > 1 Тогда	
			Элементы.ВосстановитьККМ.Доступность = Истина;		
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьККМНаСервере()
		
	ТекВр = ТекущаяДата();
	Набор = РегистрыСведений.ксСтатусыСостоянияККМ.СоздатьНаборЗаписей();
	Набор.Отбор.Период.Установить(ТекВр);
	Набор.Отбор.ККМ.Установить(Объект.Ссылка);
	Набор.Прочитать();
	
	НЗапись = Набор.Добавить();		
	НЗапись.ККМ = Объект.Ссылка;
	НЗапись.Период = ТекВр;
	НЗапись.СостояниеККМОчередьПечатиЧеков = ?(ККМВключена, Перечисления.ксСостоянияККМОчередиПечатиЧеков.ККМСвободна, Перечисления.ксСостоянияККМОчередиПечатиЧеков.ККМВыключена);
	НЗапись.ОшибкиПечатиККМ = 0;
	Набор.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьККМ(Команда)
	
	ВосстановитьККМНаСервере();
	Элементы.ВосстановитьККМ.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ксСтатусыСостоянияККМСрезПоследних.Период КАК Период,
	                      |	ксСтатусыСостоянияККМСрезПоследних.ККМ КАК ККМ,
	                      |	ксСтатусыСостоянияККМСрезПоследних.СостояниеККМОчередьПечатиЧеков КАК СостояниеККМОчередьПечатиЧеков,
	                      |	ксСтатусыСостоянияККМСрезПоследних.ОшибкиПечатиККМ КАК ОшибкиПечатиККМ
	                      |ИЗ
	                      |	РегистрСведений.ксСтатусыСостоянияККМ.СрезПоследних(, ККМ = &ККМ) КАК ксСтатусыСостоянияККМСрезПоследних");
	Запрос.УстановитьПараметр("ККМ", Объект.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();	
	
	Если Рез.Следующий() Тогда			
		Если Рез.СостояниеККМОчередьПечатиЧеков = Перечисления.ксСостоянияККМОчередиПечатиЧеков.ККМВыключена И ККМВключена Тогда
			Состояние = Перечисления.ксСостоянияККМОчередиПечатиЧеков.ККМСвободна;	
			ксРаботаСОчередьюПечатиЧековСервер.ДобавитьЗаписьВРСксСтатусыСостоянияККМ(Объект.Ссылка, Состояние);
		ИначеЕсли Рез.СостояниеККМОчередьПечатиЧеков <> Перечисления.ксСостоянияККМОчередиПечатиЧеков.ККМВыключена И НЕ ККМВключена Тогда
	        Состояние = Перечисления.ксСостоянияККМОчередиПечатиЧеков.ККМВыключена;
			ксРаботаСОчередьюПечатиЧековСервер.ДобавитьЗаписьВРСксСтатусыСостоянияККМ(Объект.Ссылка, Состояние);
		КонецЕсли;				
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПинганутьККМ(Команда)
	ПинганутьККМНаСервере();
КонецПроцедуры

Процедура ПинганутьККМНаСервере()
	
	НормАдрес = СокрЛП(Объект.АдресККМ);	
	КолСимв = СтрДлина(НормАдрес);
	АйПи = "";
	
	Для Н = 1 По КолСимв Цикл
		
		ТекСимвол = Сред(НормАдрес, Н, 1);		
		
		Если ТекСимвол = ":" Тогда		
			Прервать;	
		Иначе		
			АйПи = АйПи + ТекСимвол;			
		КонецЕсли;	 

	КонецЦикла;
	
	Результат = ксРаботаСККМСервер.Ping(АйПи);		
	Текст = ?(Результат > 0 ,"ОК", "Соединение отсутствует");
	
	Сообщить(Текст);

КонецПроцедуры
